namespace Cindy_Master.PCT.Data
{
    public class PCT_Data
    {
        public static class Buffs
        {
            public const ushort
                长Buff = 3674,
                绿黄 = 3675,
                蓝红 = 3676,
                黑彗星buff = 3691,
                锤子预备 = 3680,
                彩虹预备 = 3679,
                反转预备 = 3690,
                天星预备 = 3681,
                加速 = 3688,
                加速装置 = 3689,
                星空 = 3685,
                蛋 = 3686,
                扩散蛋 = 3687;

            // 无敌类 Buff
            public static readonly List<uint> InvincibleBuff = new List<uint>
            {
                325, 529, 656, 671, 775, 776, 969, 981, 1570, 1697, 1829, 328, 2287, 2670,
                3012, 3039, 3255, 811, 810, 409, 1304, 2955, 477, 1836
            };

            // 不可治疗类 Buff
            public static readonly List<uint> CantHealBuff = new List<uint>
            {
                811, 810, 409, 1304, 2670
            };

            // 不可攻击类 Buff
            public static readonly List<uint> UnattackableBuff = new List<uint>
            {
                2208, 2209, 2671, 4144, 3802, 3793, 1384, 2657, 1072, 639, 960, 1049,
                1133, 1599, 3522, 942, 3621
            };
        }

        public static class Spells
        {
            public const uint
                蛋 = 34685,
                扩散蛋 = 34686,
                火炎 = 34650,
                疾风 = 34651,
                流水 = 34652,
                冰结 = 34653,
                飞石 = 34654,
                闪雷 = 34655,
                烈炎 = 34656,
                冰冻 = 34659,
                白神圣 = 34662,
                黑彗星 = 34663,
                反转 = 34683,
                动物彩绘1 = 34664,
                动物彩绘2 = 34665,
                动物彩绘3 = 34666,
                动物彩绘4 = 34667,
                动物构想1 = 34670,
                动物构想2 = 34671,
                动物构想3 = 34672,
                动物构想4 = 34673,
                莫古 = 34676,
                马蒂恩 = 34677,
                武器画 = 34668,
                武器画构想 = 34674,
                锤1 = 34678,
                锤2 = 34679,
                锤3 = 34680,
                天星 = 34681,
                彩虹 = 34688,
                风景画 = 34669,
                星空 = 34675,
                动物彩绘 = 34689,
                武器彩绘 = 34690,
                风景彩绘 = 34691,
                动物构想 = 35347,
                武器构想 = 35348,
                风景构想 = 35349,
                即刻 = 7561,
                醒梦 = 7562,
                昏乱 = 7560;
        }
    }
}
